{
    "Hosts": "Devices that communicate with each other through the internet, such as Servers, smartphones, laptops, etc.",
    "End Systems":"Devices that communicate with each other through the internet, such as Servers, smartphones, laptops, etc.",
    "Communication Links": "The link that makes communication between end systems possible that ranges from coaxial cable, copper wires, radio waves etc.",
    "Packet Switches": "Takes a packet arriving on one of its incoming communication links and forwards that packet on one of its outgoing communication links.",
    "Transmission Rate": "Measurement used to measure the rate at which data is transmitted between systems. Unit: bits/second.",
    "Packet": "Data or information that has been segmented by a sending end system, along with its header, to a receiving end system.",
    "Router": "In packet-switched networks such as the internet, a router is a device that determines the best way for a packet to be forwarded to its destination.",
    "Link-Layer switch": "Typically in access networks, a device that filters and forwards packets between LAN segments.",
    "Route": "Refers to a specific entry in a router that tells the router how to transmit the data it receives ",
    "Path": "Path is the complete location or name of where a computer file, web page, or other object is located",
    "ISP": "Internet Service Provider; a network of packet switches and communication links",
    "Protocol": "Define format, order of messages sent and received among network entities, and actions taken on message transmissions.",
    "TCP": "Transmission control protocol is a network communication protocol designed to send data packets over the Internet. How it works is it fragments the data into individual pieces to avoid any congestion of bandwidth. It also gives a unique number to each data piece so as to make it easier to reassemble the data later on.",
    "IP": "Internet Protocol; specifies the format of the packets that are sent and received among routers and end systems. Similarly to TCP, it breaks down the data to individual packets but instead of adding a unique number to each packet, it adds a unique address. In the event of a traffic jam, the IP protocol will attempt to find an alternative path that is shorter than the one it is taking in order to improve efficiency.",
    "Internet Standards": "Developed by the Internet Engineering Task Force (IETF); agreement on what each protocol does so that people can create systems and products that interoperate",
    "RFC": "A Request for Comments is a formal document drafted by the Internet Engineering Task Force (IETF) that describes the specifications for a particular technology",
    "IETF": "The Internet Engineering Task Force is an open standards organization that deals with Internet standards and cooperates with International Electrotechnical Commission (IEC) and International Organization for Standardization (ISO) standards",
    "Distributed Applications": "Applications such as electronic mail, web surfing, social networks, etc, that involve multiple end systems that exchange data with each other.",
    "API": "An application programming interface (API) is a particular set of rules ('code') and specifications that software programs can follow to communicate with each other. It serves as an interface between different software programs and facilitates their interaction, similar to the way the user interface facilitates interaction between humans and computers.",
    "Network Protocols": "Network protocols are formal standards and policies comprised of rules, procedures and formats that define communication between two or more devices over a network.",
    "Network Edge": "A network located on the periphery of a centralized network.",
    "Clients": "A client is the receiving end of a service or the requestor of a service in a client/server model type of system.",
    "Servers": "A server is a computer, a device or a program that is dedicated to managing network resources.",
    "Access networks": "A network that physically connects an end system to the first router (also known as the “edge router”) on a path from the end system to any other distant end system.",
    "DSL": "Digital Subscriber Line is a communications medium used to transfer digital signals over standard telephone lines.",
    "Cable internet access": "Cable Internet access, shortened to cable Internet, is a form of broadband Internet access in which infrastructure previously used solely for cable television carries digital Internet.",
    "HFC": "Hybrid fiber coaxial refers to a broadband telecommunications network that combines optical fiber and coaxial cable",
    "FTTH": "Fiber to the home is a fiber optic communication delivery form where the fiber extends from a central office to the boundary of a home living space or business office",
    "Ethernet": "Ethernet is the standard way to connect computers on a network over a wired connection.",
    "WiFi": "Use of radio waves to transmit information across a network and provide connectivity.",
    "Physical Medium": "Refers to the physical materials that are used to transmit information in data communications. It is referred to as physical medium because the medium is generally a physical object such as copper wire or glass.",
    "Guided Media": "Those that provide a conduit from one device to another, include twisted pair cable, coaxial cable, and fiber-optic cable",
    "Unguided Media": "Transport electromagnetic waves without using a physical conductor. This type of communication is often referred to as wireless communication.",
    "UTP": "Unshielded twisted pair cable is a type of wiring in which two conductors of a single circuit are twisted together for the purposes of canceling out electromagnetic interference(EMI) from external sources.",
    "Coaxial Cable": "A coaxial cable is a type of shielded and insulated copper cable that is used in computer networks and to deliver cable TV services to end users",
    "Shared Medium": "A shared-medium is when all devices on the network (or subnetwork) share the same physical medium.",
    "Fiber Optics": "A thin, flexible medium that conducts pulses of light.",
    "Terrestrial Radio": "Denotes radio broadcasted from towers on the surface of the planet.",
    "Satellite Radio": "A communication satellite links two or more Earth-based microwave transmitter/ receivers, known as ground stations. The satellite receives transmissions on one frequency band, regenerates the signal using a repeater, and transmits the signal on another frequency. ",
    "Geostationary Satellite": "Satellites that permanently remain above the same spot on Earth. This huge distance from ground station through satellite back to ground station introduces a substantial signal propagation delay.",
    "LEO Satellite": "LEO(low-earth orbiting ) satellites are placed much closer to Earth and do not remain permanently above one spot on Earth. They rotate around Earth (just as the Moon does) and may communicate with each other, as well as with ground stations. To provide continuous coverage to an area, many satellites need to be placed in orbit.",
    "Messages": "The packet of information exchanged between an application at one end and an application at the other end in the system.",
    "Store-and-forward": "Store-and-forward transmission means that the packet switch must receive the entire packet before it can begin to transmit the first bit of the packet onto the outbound link",
    "Output buffer or Output queue": "A region in physical memory to temporarily store outgoing packets that the router is about to send into that link. If an arriving packet needs to be transmitted onto a link but finds the link busy with the transmission of another packet, the arriving packet must wait in the output buffer/queue.",
    "Forwarding table": "Maps destination addresses (or portions of the destination addresses) to that router’s outbound links. When a packet arrives at a router, the router examines the address and searches its forwarding table, using this destination address, to find the appropriate outbound link. The router then directs the packet to this outbound link.",
    "Circuit Switching": "All packets in the network follow the same route to get to their destination and makes it easier to assemble once all the packets have reached their destination. This is because all the packets arrive in the order that they were sent.",
    "Packet Switching": "All packets in the network follow a different path to get to their destination and makes it harder to assemble once all the packets have reached their destination. This is because the order that they arrived in is completely different from the order that they were sent.",
    "Circuit": " A connection for which the switches on the path between the sender and receiver maintain connection state for that connection.",
    "End-to-end Connection": "Direct, dedicated connection from two end systems.",
    "FDM": "Frequency-division multiplexing is a technique for sending two or more signals over the same telephone line, radio channel, or other medium. Each signal is transmitted as a unique range of frequencies within the bandwidth of the channel as a whole, enabling several signals to be transmitted simultaneously.",
    "TDM": "Time-division multiplexing is a method of putting multiple data streams in a single signal by separating the signal into many segments, each having a very short duration",
    "Bandwidth": "The amount of data that can be transmitted in a fixed amount of time.",
    "Silent Periods": "A connection that “holds” a physical line even when there is nothing to transmit is called a silent period.",
    "Customer": "Entity which pays for Internet access from an ISP.",
    "Provider": "Entity which provides Internet access.",
    "Regional ISP": "ISP to which the access ISPs in the region connect.",
    "Tier-1 ISP": "ISP to which each regional ISP connect.",
    "PoP for ISP": "Points of presence; a group of one or more routers (at the same location) in the provider's network where customer ISPs can connect into the provider ISP.",
    "Multi-homed ISP": "An ISP which connections to two or more provider ISPs.",
    "Peer": "To allow networks to directly connect together so that all the traffic between them passes over the direct connection rather than through upstream intermediaries.",
    "IXP": "An internet exchange point is a physical network access point through which major network providers connect their networks and exchange traffic.",
    "Content Provider Networks": "A globally distributed network of proxy servers deployed in multiple data centers.",
    "Nodal processing delay": "The time it takes to process a packet in a network node (router, switch, hub, etc.), which is dependent on the speed of the device and congestion in the network.",
    "Queuing delay": "The amount of time the packet is waiting in the queue before taken up for processing.",
    "Transmission delay": "Amount of time taken by the router to transfer the packet to outgoing link.",
    "Propagation delay": "Amount of time taken by the packet to make a physical journey from one router to another router.",
    "Total nodal delay": "Sum of all 4 latency delays. These 4 are Nodal processing delay, queuing delay, transmission delay and propagation delay.",
    "Traffic intensity": "Used to estimate the extent of the queuing delay using the ratio La/R Where L consists of the number of bits in the packet, a denotes the average rate at which packets arrive at the queue and R is the transmission rate.",
    "Packet drop": "When router receives it and specifically decides not to pass it on to the next hop. This deliberate loss of a packet is called dropping.",
    "Packet loss": "When one or more packets of data travelling across a computer network fail to reach their destination. Packet loss is typically caused by network congestion. Packet loss is measured as a percentage of packets lost with respect to packets sent.",
    "Traceroute": "Traceroute is a network diagnostic tool used to track the pathway taken by a packet on an IP network from source to destination",
    "Instantaneous throughput": "Rate of task completion in a “small” interval around time t such as the exact moment a host receives a file.  ",
    "Average throughput": "Number of tasks completed in interval / T. For example, If the file consists of F bits and the transfer takes T seconds for Host B to receive all F bits, then the average throughput of the file transfer is F/T bits/sec.",
    "Bottleneck link": "Link in a network with the lowest throughput.",
    "Layered architecture": "An architecture in which data moves from one defined level of processing to another.",
    "Service model": "The services that a layer offers to the layer above.",
    "Internet protocol stack": "A Internet protocol stack is a complete set of 5 network protocol layers that work together to provide networking capabilities. It is called a stack because it is typically designed as a hierarchy of layers, each supporting the one above it and using those below it. The 5 layers are the application layer, transport layer, network layer, link layer and physical layer.",
    "ISO OSI Protocol stack": "The Open System Interconnection (OSI) model defines a conceptual networking framework to implement protocols in seven layers. The seven layers are the physical layer, data link layer, network layer, transport layer, session layer, presentation layer and application layer.",
    "Application-layer message": "Data that an application wants to send and is passed on to the transport layer for further encapsulation.",
    "Transport-layer segment": "A protocol data unit which consists a TCP header and an application data piece (packet) which comes from the (upper) Application Layer",
    "Network-layer datagram": "A self-contained, independent entity of data carrying sufficient information to be routed from the source to the destination computer without reliance on earlier exchanges between this source and destination computer and the transporting network.",
    "Link-layer Frame": "A frame is the protocol data unit at the data link layer. Frames are the result of the final layer of encapsulation before the data is transmitted over the physical layer. A frame is the unit of transmission in a link layer protocol, and consists of a link layer header followed by a packet.",
    "Payload field": "Refers to the “actual data” in a packet minus all headers attached for transport and minus all descriptive metadata.",

}
